In [7]:
import numpy as np
import pandas as pd

In [3]:
np.NaN

nan

not eaqual to anything

In [8]:
np.NaN == True

False

it is NULL

In [9]:
pd.isnull(np.NaN)

True

In [10]:
visited = pd.read_csv('./2016-pydata-carolinas-pandas/data/survey_visited.csv')

In [11]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

wylacz domyslne wstawianie NaN

In [12]:
visited = pd.read_csv('./2016-pydata-carolinas-pandas/data/survey_visited.csv', keep_default_na=False)

In [13]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

manualnie dodaj definicje braku danych

In [14]:
visited = pd.read_csv('./2016-pydata-carolinas-pandas/data/survey_visited.csv', keep_default_na=False, na_values=[''])

In [15]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

quick way inside the column

In [16]:
visited.dated

0    1927-02-08
1    1927-02-10
2    1939-01-07
3    1930-01-12
4    1930-02-26
5           NaN
6    1932-01-14
7    1932-03-22
Name: dated, dtype: object

robisz wektor [operacja na elemencie] -> pandas zrobi daną operację na wszystkich elementach wektora

In [17]:
pd.isnull(visited.dated)

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
Name: dated, dtype: bool

In [19]:
visited.ix[pd.isnull(visited.dated),]

   ident  site dated
5    752  DR-3   NaN